<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"2ef1dfb46a19d7f27cd93ba12e0bc758c7c3625ce4c33ffcaa124e0b85d1303e","backend":"f55c599486ccae5e01f16c9c269f53fb7f0dd52b3d095dfdfb33cef297a854db","plan_job_ref":"Job Terraform Plan #9 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6774516080","plan_hash":"9ad05a21ed6360c89c8bda5eda3c823175803c5083dfd370981d0e7acdfd0adb","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_ecs_service.jtb_service`
<details>
<summary>Plan: 14 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.autoscaling_group will be created
  + resource "aws_autoscaling_group" "autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "us-east-2a",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Module"
          + propagate_at_launch = true
          + value               = "ECS Cluster"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "jtb_ecs-cluster"
        }
    }

  # aws_ecs_capacity_provider.capacity_provider will be created
  + resource "aws_ecs_capacity_provider" "capacity_provider" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "Clusterjtb_ecs-clusterCapacityProvider"
      + tags     = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = (known after apply)
        }
    }

  # aws_ecs_cluster.jtb_ecs-cluster will be created
  + resource "aws_ecs_cluster" "jtb_ecs-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "jtb_ecs-cluster"
      + tags_all           = (known after apply)
    }

  # aws_ecs_cluster_capacity_providers.capacity_providers will be created
  + resource "aws_ecs_cluster_capacity_providers" "capacity_providers" {
      + capacity_providers = [
          + "Clusterjtb_ecs-clusterCapacityProvider",
        ]
      + cluster_name       = "jtb_ecs-cluster"
      + id                 = (known after apply)
    }

  # aws_ecs_service.jtb_service will be created
  + resource "aws_ecs_service" "jtb_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "EcsClusterjtb_ecs-clusterService"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all                           = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false
    }

  # aws_ecs_task_definition.jtb_task_definition will be created
  + resource "aws_ecs_task_definition" "jtb_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image   = "596332158252.dkr.ecr.us-east-2.amazonaws.com/judo-techniques-bot:latest"
                  + name    = "jtb"
                  + secrets = [
                      + {
                          + name      = "DB_HOST"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_host"
                        },
                      + {
                          + name      = "DB_NAME"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_name"
                        },
                      + {
                          + name      = "DB_USER"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_user"
                        },
                      + {
                          + name      = "DB_PORT"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_port"
                        },
                      + {
                          + name      = "DB_PASS"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_pass"
                        },
                      + {
                          + name      = "USER_AGENT"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/user_agent"
                        },
                      + {
                          + name      = "CLIENT_ID"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_id"
                        },
                      + {
                          + name      = "CLIENT_SECRET"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_secret"
                        },
                      + {
                          + name      = "REDDIT_USERNAME"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_username"
                        },
                      + {
                          + name      = "REDDIT_PASSWORD"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_password"
                        },
                      + {
                          + name      = "SUBREDDITS"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/subreddits"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/sentry_dsn"
                        },
                    ]
                },
            ]
        )
      + execution_role_arn       = (known after apply)
      + family                   = "EcsClusterjtb_ecs-clusterTaskDefinition"
      + id                       = (known after apply)
      + memory                   = "427"
      + network_mode             = "host"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all                 = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
    }

  # aws_iam_instance_profile.ecs_node will be created
  + resource "aws_iam_instance_profile" "ecs_node" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "EcsClusterjtb_ecs-clusterEc2InstanceProfile"
      + path        = "/"
      + role        = "EcsClusterjtb_ecs-clusterEc2InstanceRole"
      + tags        = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all    = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_instance_role will be created
  + resource "aws_iam_role" "ec2_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsClusterjtb_ecs-clusterEc2InstanceRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all              = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsClusterjtb_ecs-clusterDefaultTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all              = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_ssm_parameters_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_ssm_parameters_policy" {
      + id     = (known after apply)
      + name   = "EcsClusterjtb_ecs-clusterSSMParametersPolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_host",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_name",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_pass",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_port",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_user",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_id",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_secret",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_password",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_username",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/sentry_dsn",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/subreddits",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/user_agent",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "EcsClusterjtb_ecs-clusterDefaultTaskRole"
    }

  # aws_iam_role_policy_attachment.default_task_role will be created
  + resource "aws_iam_role_policy_attachment" "default_task_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "EcsClusterjtb_ecs-clusterDefaultTaskRole"
    }

  # aws_iam_role_policy_attachment.ecs_instance_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "EcsClusterjtb_ecs-clusterEc2InstanceRole"
    }

  # aws_launch_template.launch_template will be created
  + resource "aws_launch_template" "launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "*********************"
      + instance_type          = "t4g.nano"
      + latest_version         = (known after apply)
      + name                   = "EcsClusterjtb_ecs-clusterLaunchTemplate"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKZWNobyAiRUNTX0NMVVNURVI9anRiX2Vjcy1jbHVzdGVyIiA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCmRuZiB1cGRhdGUKZG5mIGluc3RhbGwgLXkgZWMyLWluc3RhbmNlLWNvbm5lY3QK"
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Module" = "ECS Cluster"
              + "Name"   = "jtb_ecs-cluster"
            }
        }
    }

  # aws_security_group.ecs_security_group will be created
  + resource "aws_security_group" "ecs_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "EcsClusterjtb_ecs-clusterSecurityGroup"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + tags_all               = {
          + "Module" = "ECS Cluster"
          + "Name"   = "jtb_ecs-cluster"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #9](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6774516080)